Revit 2027 API
RebarSpliceUtils.GetSpliceGeometries Method
 Computes a list of RebarSpliceGeometry which respects the rules. This list can be used to splice the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarSpliceByRulesResult GetSpliceGeometries(
	Document document,
	ElementId rebarIdToSplice,
	RebarSpliceOptions spliceOptions,
	RebarSpliceRules spliceRules
)
Public Shared Function GetSpliceGeometries (
	document As Document,
	rebarIdToSplice As ElementId,
	spliceOptions As RebarSpliceOptions,
	spliceRules As RebarSpliceRules
) As RebarSpliceByRulesResult
public:
static RebarSpliceByRulesResult^ GetSpliceGeometries(
	Document^ document,
	ElementId^ rebarIdToSplice,
	RebarSpliceOptions^ spliceOptions,
	RebarSpliceRules^ spliceRules
)
static member GetSpliceGeometries :
        document : Document *
        rebarIdToSplice : ElementId *
        spliceOptions : RebarSpliceOptions *
        spliceRules : RebarSpliceRules -> RebarSpliceByRulesResult
Parameters
document Document
 The document
rebarIdToSplice ElementId
 Rebar id to splice.
spliceOptions RebarSpliceOptions
 The rebar splice options.
spliceRules RebarSpliceRules
 The splice rules.
Return Value
RebarSpliceByRulesResult
 Returns the result of the operation. If the operation was successful the RebarSpliceByRulesResult.Error member will have "RebarSpliceByRulesError.Success" value.
Exceptions
Exception | Condition
ArgumentException |  RebarSplicePosition should be Middle.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSpliceUtils Class
Autodesk.Revit.DB.Structure Namespace